app/views/leaves/index.html.erb

SELECT "leaves".* FROM "leaves"
---
  <tboby>
    <tr><td>Casual Leave</td><td><%= Leave.count(current_user) %></td><td><%= get_type_leave("Casual Leave")%></td></tr>