app/views/leaves/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
<div class= "container">
   <h1><%= @leave.user.firstname %></h1>