app/controllers/leaves_controller.rb

  def index
   @leaves = Leave.all
---
SELECT "leaves".* FROM "leaves"

  def show
     @leave = Leave.find(params[:id])
---
SELECT  "leaves".* FROM "leaves" WHERE "leaves"."id" = $1 LIMIT 1  [["id", 5]]

  def create

     @leave = Leave.new(user_params)
     @leave.from_date = @leave.from_date.strftime("%m-%d-%Y")
     @leave.to_date = @leave.to_date.strftime("%m-%d-%Y")
     if @leave.save
---
INSERT INTO "leaves" ("to_date", "reason", "type_of_leave", "no_of_days", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["to_date", "2015-10-20"], ["reason", "Fever"], ["type_of_leave", "Planned Leave"], ["no_of_days", 12], ["created_at", "2015-10-27 13:03:07.001149"], ["updated_at", "2015-10-27 13:03:07.001149"]]